Revit 2027 API
BuiltInFailures.JoinElementsFailures.StructGroupMemberWillDetachFromGrid Property
 A structural element will be detached from grid(s) due to inconsistent group membership.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructGroupMemberWillDetachFromGrid { get; }
Public Shared ReadOnly Property StructGroupMemberWillDetachFromGrid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructGroupMemberWillDetachFromGrid {
	FailureDefinitionId^ get ();
}
static member StructGroupMemberWillDetachFromGrid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace